index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-18 Wed 12:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mike Hostetler's Literate Dotfiles</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mike Hostetler" />
<meta name="keywords" content="dotfiles config orgmode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Mike Hostetler's Literate Dotfiles</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5ae7a35">1. The Technical Part</a></li>
<li><a href="#org8ad2338">2. Soft Part</a></li>
<li><a href="#org470e277">3. Requirements</a></li>
<li><a href="#org12d6184">4. Configs found here</a></li>
</ul>
</div>
</div>
<p>
These are my config files. There are many like it, and many of those are certainly better, but these are mine. 
</p>


<p>
This was written as an example of <a href="https://en.wikipedia.org/wiki/Literate_programming">literate programming</a>. The original markup is in the magnificent <a href="https://orgmode.org">OrgMode</a> and then exported to source and HTML via some Emacs magic. I didn't come up with this myself &#x2013; I'm using the source from <a href="https://writepermission.com/introducing-literate-dotfiles.html">Toon Claes</a>. 
</p>

<p>
<a href="https://squarepegsys.github.io/literate-dotfiles/">See the published version</a>.
</p>

<div id="outline-container-org5ae7a35" class="outline-2">
<h2 id="org5ae7a35"><span class="section-number-2">1</span> The Technical Part</h2>
<div class="outline-text-2" id="text-1">
<p>
This really uses the magic of OrgMode to generate. In OrgMode, you can put in <a href="https://orgmode.org/manual/Working-with-source-code.html">code blocks</a> and export them to a file, which is called <a href="https://orgmode.org/manual/tangle.html">tangling</a>. OrgMode also <a href="https://orgmode.org/manual/HTML-export.html">exports to HTML</a>. Now there is a <a href="Makefile#MissingReference">makefile</a> to handle this on the command line but it all uses Emacs.
</p>

<p>
The look and feel is <code>ReadTheOrg</code> from <a href="https://github.com/fniessen/org-html-themes">org-html-themes</a>. 
</p>
</div>
</div>

<div id="outline-container-org8ad2338" class="outline-2">
<h2 id="org8ad2338"><span class="section-number-2">2</span> Soft Part</h2>
<div class="outline-text-2" id="text-2">
<p>
I'm choosy on which I'm implementing here. Some are too private or specific to me to publish and others because I don't think it's interesting. 
</p>
</div>
</div>

<div id="outline-container-org470e277" class="outline-2">
<h2 id="org470e277"><span class="section-number-2">3</span> Requirements</h2>
<div class="outline-text-2" id="text-3">
<p>
If you want to build them, you will need:
</p>

<ul class="org-ul">
<li>a command-line Emacs</li>
<li>a copy of <code>org-contrib-plus</code>, which I had to install myself.</li>
<li>make to run makefile</li>
</ul>
</div>
</div>

<div id="outline-container-org12d6184" class="outline-2">
<h2 id="org12d6184"><span class="section-number-2">4</span> Configs found here</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="aliases.html">Alias Collection</a></li>
<li><a href="shortcuts-el.html">Random Emacs Shortcuts</a></li>
<li><a href="font-el.html">Emacs Font Config</a></li>
<li><a href="tmux-config.html">Tmux.conf</a></li>
<li><a href="direnvrc.html">Direnv config</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mike Hostetler</p>
<p class="date">Created: 2019-09-18 Wed 12:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
